{
	"siteVersion": "1.134.0",
	"_meta": {
		"sources": [
			{
				"json": "PandemoniumIvory",
				"abbreviation": "Pan",
				"full": "Pandemonium/Ivory",
				"url": "",
				"authors": [
					"akzidenz"
				],
				"convertedBy": []
			}
		],
		"dateAdded": 1629948362,
		"dateLastModified": 1629948362
	},
	"monster": [
		{
			"name": "Owl Amalgamate",
			"source": "PandemoniumIvory",
			"size": "S",
			"type": "monstrosity",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				14
			],
			"hp": {
				"formula": "3d8 + 6",
				"average": 20
			},
			"speed": {
				"walk": 30,
				"fly": 30,
				"canHover": false
			},
			"str": 14,
			"dex": 14,
			"con": 14,
			"int": 10,
			"wis": 2,
			"cha": 7,
			"senses": [
				"darkvision 60ft."
			],
			"passive": 6,
			"resist": [
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from non-magical weapons"
				}
			],
			"cr": "1/2",
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The owl amalgamate makes two attacks: one with its bite and one with its ram, or two with its spikes."
					]
				},
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 4} to hit, reach 5 ft., one target. {@h}7 ({@damage 1d10 + 2}) piercing damage."
					]
				},
				{
					"name": "Ram",
					"entries": [
						"{@atk mw} {@hit 4} to hit, reach 5 ft., one target. {@h}5 ({@damage 1d6 + 2}) bludgeoning damage."
					]
				},
				{
					"name": "Spike",
					"entries": [
						"{@atk rw} {@hit 4} to hit, range 30/90 ft., one target. {@h}5 ({@damage 1d6 + 2}) piercing damage, and the target must succeed on a {@dc 12} Constitution saving throw or take 4 ({@damage 1d8}) poison damage."
					]
				}
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"damageTags": [
				"B",
				"I",
				"P"
			],
			"miscTags": [
				"MW",
				"RW"
			]
		},
		{
			"name": "Octopus-Ghast Amalgamate",
			"source": "PandemoniumIvory",
			"size": "L",
			"type": "monstrosity",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				12
			],
			"hp": {
				"formula": "10d8",
				"average": 46
			},
			"speed": {
				"walk": 30,
				"swim": 30
			},
			"str": 16,
			"dex": 17,
			"con": 10,
			"int": 11,
			"wis": 10,
			"cha": 8,
			"senses": [
				"darkvision 60ft."
			],
			"passive": 10,
			"resist": [
				"necrotic"
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"charmed",
				"exhaustion",
				"poisoned"
			],
			"languages": [
				"Common"
			],
			"cr": "2",
			"trait": [
				{
					"name": "Stench",
					"entries": [
						"Any creature that starts its turn within 10 feet of the octopus-ghast amalgamate must succeed on a {@dc 14} Constitution saving throw or be {@condition poisoned} until the start of its next turn. On a successful saving throw, the creature is immune to the octopus-ghast amalgamate's stench for 24 hours."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The octopus-ghast amalgamate makes five attacks: one with its claw and four with its tentacles."
					]
				},
				{
					"name": "Claw",
					"entries": [
						"{@atk mw} {@hit 5} to hit, reach 5 ft., one target. {@h}10 ({@damage 2d6 + 3}) slashing damage. If the target is a creature other than an undead, it must succeed on a {@dc 10} Constitution saving throw or be {@condition paralyzed} for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
					]
				},
				{
					"name": "Tentacle",
					"entries": [
						"{@atk mw} {@hit 5} to hit, reach 15 ft., one target. {@h}10 ({@damage 2d6 + 3}) bludgeoning damage. If the target is a Medium or smaller creature, it is {@condition grappled} (escape {@dc 16}). Until this grapple ends, the target is {@condition restrained}, and one attack must always target the {@condition grappled} creature."
					]
				}
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack",
				"Tentacles"
			],
			"languageTags": [
				"C"
			],
			"damageTags": [
				"B",
				"S"
			],
			"miscTags": [
				"MW",
				"RCH"
			],
			"conditionInflict": [
				"grappled",
				"paralyzed",
				"poisoned",
				"restrained"
			]
		},
		{
			"name": "Marmot-folk",
			"source": "PandemoniumIvory",
			"size": "S",
			"type": {
				"type": "humanoid",
				"tags": [
					"marmot-folk"
				]
			},
			"alignment": [
				"L",
				"N"
			],
			"ac": [
				12
			],
			"hp": {
				"formula": "3d8 + 3",
				"average": 17
			},
			"speed": {
				"walk": 30
			},
			"str": 12,
			"dex": 14,
			"con": 12,
			"int": 8,
			"wis": 8,
			"cha": 12,
			"senses": [
				"darkvision 30 ft."
			],
			"passive": 9,
			"languages": [
				"Common"
			],
			"cr": "1/2",
			"trait": [
				{
					"name": "Keen Smell",
					"entries": [
						"The marmot-folk has advantage on Wisdom ({@skill Perception}) checks that rely on smell."
					]
				},
				{
					"name": "Pack Tactics",
					"entries": [
						"The marmot-folk has advantage on an attack roll against a creature if at least one of the marmot-folk's allies is within 5 feet of the creature and the ally isn't {@condition incapacitated}."
					]
				}
			],
			"action": [
				{
					"name": "Spear",
					"entries": [
						"{@atk mw,rw} {@hit 3} to hit, reach 5 ft. or range 20/60 ft., one target. {@h}5 ({@damage 1d6 + 1}) piercing damage, or 6 ({@damage 1d8 + 1}) piercing damage if used with two hands to make a melee attack."
					]
				},
				{
					"name": "Shortbow",
					"entries": [
						"{@atk rw} {@hit 4} to hit, range 80/320 ft., one target. {@h}5 ({@damage 1d6 + 2}) piercing damage."
					]
				}
			],
			"environment": [
				"desert",
				"forest",
				"grassland",
				"hill"
			],
			"fluff": {
				"name": "Gnoll",
				"source": "MM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"Gnolls are feral humanoids that attack settlements along the frontiers and borderlands of civilization without warning, slaughtering their victims and devouring their flesh.",
									{
										"name": "Demonic Origin",
										"type": "entries",
										"entries": [
											"The origin of the gnolls traces back to a time when the demon lord Yeenoghu found his way to the Material Plane and ran amok. Packs of ordinary hyenas followed in his wake, scavenging the demon lord's kills. Those hyenas were transformed into the first gnolls, parading after Yeenoghu until he was banished back to the Abyss. The gnolls then scattered across the face of the world, a dire reminder of demonic power."
										]
									},
									{
										"name": "Nomadic Destroyers",
										"type": "entries",
										"entries": [
											"Gnolls are dangerous because they strike at random. They emerge from the wilderness, plunder and slaughter, then move elsewhere. They attack like a plague of locusts, pillaging settlements and leaving little behind but razed buildings, gnawed corpses, and befouled land. Gnolls choose easy targets for their raids. Armored warriors holed up in a fortified castle will survive a rampaging gnoll horde unscathed, even as the towns, villages, and farms that surround the castle are ablaze, their people slaughtered and devoured.",
											"Gnolls rarely build permanent structures or craft anything of lasting value. They don't make weapons or armor, but scavenge such items from the corpses of their fallen victims, stringing ears, teeth, scalps, and other trophies from their foes onto their patchwork armor.",
											{
												"name": "Thirst for Blood",
												"entries": [
													" No goodness or compassion resides in the heart of a gnoll. Like a demon, it lacks anything resembling a conscience, and can't be taught or coerced to put aside its destructive tendencies. The gnolls' frenzied bloodlust makes them an enemy to all, and when they lack a common foe, they fight among themselves. Even the most savage orcs avoid allying with gnolls."
												],
												"type": "entries"
											}
										]
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Gnoll.jpg"
						}
					}
				]
			},
			"tokenUrl": "https://5e.tools/img/MM/Gnoll.png?v=1.134.0",
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/gnoll.mp3?v=1.134.0"
			},
			"traitTags": [
				"Keen Senses",
				"Pack Tactics"
			],
			"senseTags": [
				"D"
			],
			"languageTags": [
				"C"
			],
			"damageTags": [
				"P"
			],
			"miscTags": [
				"MW",
				"RNG",
				"RW",
				"THW"
			],
			"hasFluff": true,
			"hasFluffImages": true
		},
		{
			"name": "Abyssal Sea Hag",
			"source": "PandemoniumIvory",
			"size": "L",
			"type": "fey",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 12,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"formula": "6d8 + 24",
				"average": 52
			},
			"speed": {
				"walk": 40,
				"swim": 50,
				"fly": 10,
				"canHover": false
			},
			"str": 20,
			"dex": 15,
			"con": 18,
			"int": 12,
			"wis": 12,
			"cha": 13,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 11,
			"languages": [
				"Aquan",
				"Common",
				"Giant"
			],
			"cr": {
				"cr": "2",
				"coven": "4"
			},
			"spellcasting": [
				{
					"name": "Spellcasting",
					"headerEntries": [
						"The abyssal sea hag is a ~8th-level spellcaster. Its spellcasting ability is Intelligence (spell save {@dc 13}, +5 to hit with spell attacks). It has the following spells prepared:"
					],
					"spells": {
						"0": {
							"spells": [
								"{@spell friends}",
								"{@spell mage hand}",
								"{@spell minor illusion}",
								"{@spell primal savagery|XGE}"
							]
						},
						"1": {
							"spells": [
								"{@spell ray of sickness}",
								"{@spell Tasha's caustic brew|TCE}",
								"{@spell Tasha's hideous laughter}",
								"{@spell witch bolt}"
							],
							"slots": 4
						},
						"2": {
							"spells": [
								"{@spell misty step}",
								"{@spell phantasmal force}",
								"{@spell Snilloc's snowball swarm|XGE}",
								"{@spell suggestion}",
								"{@spell Tasha's mind whip|TCE}"
							],
							"slots": 2
						},
						"3": {
							"spells": [
								"{@spell fly}",
								"{@spell revivify}",
								"{@spell sleet storm}",
								"{@spell thunder step|XGE}",
								"{@spell tidal wave|XGE}"
							],
							"slots": 1
						},
						"4": {
							"spells": [
								"{@spell polymorph}"
							],
							"slots": 1
						}
					},
					"ability": "int",
					"type": "spellcasting"
				}
			],
			"trait": [
				{
					"name": "Amphibious",
					"entries": [
						"The hag can breathe air and water."
					]
				},
				{
					"name": "Horrific Appearance",
					"entries": [
						"Any humanoid that starts its turn within 30 feet of the hag and can see the hag's true form must make a {@dc 12} Wisdom saving throw. On a failed save, the creature is {@condition frightened} for 1 minute. A creature can repeat the saving throw at the end of each of its turns, with disadvantage if the hag is within line of sight, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the hag's Horrific Appearance for the next 24 hours.",
						"Unless the target is surprised or the revelation of the hag's true form is sudden, the target can avert its eyes and avoid making the initial saving throw. Until the start of its next turn, a creature that averts its eyes has disadvantage on attack rolls against the hag."
					]
				}
			],
			"action": [
				{
					"name": "Claws",
					"entries": [
						"{@atk mw} {@hit 7} to hit, reach 5 ft., one target. {@h}15 ({@damage 3d6 + 5}) slashing damage."
					]
				},
				{
					"name": "Death Glare",
					"entries": [
						"The hag targets one {@condition frightened} creature she can see within 30 feet of her. If the target can see the hag, it must succeed on a {@dc 12} Wisdom saving throw against this magic or drop to 0 hit points."
					]
				},
				{
					"name": "Illusory Appearance",
					"entries": [
						"The hag covers herself and anything she is wearing or carrying with a magical illusion that makes her look like an ugly creature of her general size and humanoid shape. The effect ends if the hag takes a bonus action to end it or if she dies.",
						"The changes wrought by this effect fail to hold up to physical inspection. For example, the hag could appear to have no claws, but someone touching her hand might feel the claws. Otherwise, a creature must take an action to visually inspect the illusion and succeed on a {@dc 17} Intelligence (Investigation) check to discern that the hag is disguised."
					]
				}
			],
			"legendaryGroup": {
				"name": "Sea Hag",
				"source": "MM"
			},
			"variant": [
				{
					"name": "Hag Covens",
					"entries": [
						"When hags must work together, they form covens, in spite of their selfish natures. A coven is made up of hags of any type, all of whom are equals within the group. However, each of the hags continues to desire more personal power.",
						"A coven consists of three hags so that any arguments between two hags can be settled by the third. If more than three hags ever come together, as might happen if two covens come into conflict, the result is usually chaos.",
						{
							"type": "spellcasting",
							"name": "Shared Spellcasting (Coven Only)",
							"headerEntries": [
								"While all three members of a hag coven are within 30 feet of one another, they can each cast the following spells but must share the spell slots among themselves, exception to the abyssal sea hag spell slots:</br>At will: {@spell friends}, {@spell mage hand}, {@spell primal savagery}, {@spell minor illusion}"
							],
							"spells": {
								"1": {
									"slots": 4,
									"spells": [
										"{@spell witch bolt}",
										"{@spell tasha's caustic brew}",
										"{@spell tasha's hideous laughter}",
										"{@spell ray of sickness}"
									]
								},
								"2": {
									"slots": 3,
									"spells": [
										"{@spell suggestion}",
										"{@spell tasha's mind whip}",
										"{@spell phantasmal force}",
										"{@spell misty step}",
										"{@spell snilloc's snowball swarm}"
									]
								},
								"3": {
									"slots": 3,
									"spells": [
										"{@spell tidal wave}",
										"{@spell thunder step}",
										"{@spell revivify}",
										"{@spell sleet storm}",
										"{@spell fly}"
									]
								},
								"4": {
									"slots": 3,
									"spells": [
										"{@spell phantasmal killer}",
										"{@spell wall of fire}",
										"{@spell evard's black tentacles}",
										"{@spell blight}",
										"{@spell polymorph}"
									]
								},
								"5": {
									"slots": 1,
									"spells": [
										"{@spell cone of cold}",
										"{@spell cloudkill}"
									]
								}
							},
							"footerEntries": [
								"For casting these spells, each hag is a 12th-level spellcaster that uses Intelligence as her spellcasting ability. The spell save DC is 12 + the hag's Intelligence modifier, and the spell attack bonus is 4 + the hag's Intelligence modifier."
							]
						},
						{
							"type": "entries",
							"name": "Hag Eye",
							"entries": [
								"A hag coven can craft a magic item called a hag eye, which is made from a real eye coated in varnish and often fitted to a pendant or other wearable item. The hag eye is usually entrusted to a minion for safekeeping and transport. A hag in the coven can take an action to see what the hag eye sees if the hag eye is on the same plane of existence. A hag eye has AC 10, 1 hit point, and darkvision with a radius of 60 feet. If it is destroyed, each coven member takes {@damage 3d10} psychic damage and is {@condition blinded} for 24 hours.",
								"A hag coven can have only one hag eye at a time, and creating a new one requires all three members of the coven to perform a ritual. The ritual takes 1 hour, and the hags can't perform it while {@condition blinded}. During the ritual, if the hags take any action other than performing the ritual, they must start over."
							]
						}
					],
					"type": "variant"
				}
			],
			"environment": [
				"coastal",
				"underwater"
			],
			"fluff": {
				"name": "Sea Hag",
				"source": "MM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"Sea hags live in dismal and polluted underwater lairs, surrounded by merrow and other aquatic monsters.",
									"Beauty drives a sea hag to fits of anger. When confronted with something beautiful, the hag might simply attack it or deface it. If something beautiful gives hope, a sea hag wants it to cause despair. If it inspires courage, the sea hag wants it to cause fear.",
									{
										"type": "entries",
										"name": "Ugly Inside and Out",
										"entries": [
											"Sea hags are by far the ugliest of all hags, with slimy scales covering their pallid skin. A sea hag's hair resembles seaweed and covers her emaciated body, and her glassy eyes seem as lifeless as a doll's. Although a sea hag can hide her true form under a veil of illusion, the hag is cursed to forever appear ugly. Her illusory form appears haggard at best."
										]
									},
									{
										"type": "entries",
										"name": "Covens",
										"entries": [
											"A sea hag that is part of a coven (see the \"Hag Covens\" sidebar) has a challenge rating of 4 (1,100 XP)."
										]
									}
								]
							}
						]
					},
					{
						"type": "section",
						"name": "Hags",
						"entries": [
							"Hags represent all that is evil and cruel. Though they resemble withered crones, there is nothing mortal about these monstrous creatures, whose forms reflect only the wickedness in their hearts.",
							{
								"type": "entries",
								"name": "Faces of Evil",
								"entries": [
									"Ancient beings with origins in the Feywild, hags are cankers on the mortal world. Their withered faces are framed by long, frayed hair, horrid moles and warts dot their blotchy skin, and their long, skinny fingers are tipped by claws that can slice open flesh with a touch. Their simple clothes are always tattered and filthy.",
									"All hags possess magical powers, and some have an affinity for spellcasting. They can alter their forms or curse their foes, and their arrogance inspires them to view their magic as a challenge to the magic of the gods, whom they blaspheme at every opportunity.",
									"Hags name themselves in darkly whimsical ways, claiming monikers such as Black Morwen, Peggy Pigknuckle, Grandmother Titchwillow, Nanna Shug, Rotten Ethel, or Auntie Wormtooth."
								]
							},
							{
								"type": "entries",
								"name": "Monstrous Motherhood",
								"entries": [
									"Hags propagate by snatching and devouring human infants. After stealing a baby from its cradle or its mother's womb, the hag consumes the poor child. A week later, the hag gives birth to a daughter who looks human until her thirteenth birthday, whereupon the child transforms into the spitting image of her hag mother.",
									"Hags sometimes raise the daughters they spawn, creating covens. A hag might also return the child to its grieving parents, only to watch from the shadows as the child grows up to become a horror."
								]
							},
							{
								"type": "entries",
								"name": "Dark Bargains",
								"entries": [
									"Arrogant to a fault, hags believe themselves to be the most cunning of creatures, and they treat all others as inferior. Even so, a hag is open to dealing with mortals as long as those mortals show the proper respect and deference. Over their long lives, hags accumulate much knowledge of local lore, dark creatures, and magic, which they are pleased to sell.",
									"Hags enjoy watching mortals bring about their own downfall, and a bargain with a hag is always dangerous. The terms of such bargains typically involve demands to compromise principles or give up something dear-especially if the thing lost diminishes or negates the knowledge gained through the bargain."
								]
							},
							{
								"type": "entries",
								"name": "A Foul Nature",
								"entries": [
									"Hags love the macabre and festoon their garb with dead things and accentuate their appearance with bones, bits of flesh, and filth. They nurture blemishes and pick at wounds to produce weeping, suppurating flesh. Attractive creatures evoke disgust in a hag, which might \"help\" such creatures by disfiguring or transforming them.",
									"This embrace of the disturbing and unpleasant extends to all aspects of a hag's life. A hag might fly in a magical giant's skull, landing it on a tree shaped to resemble an enormous headless body. Another might travel with a menagerie of monsters and slaves kept in cages, and disguised by illusions to lure unwary creatures close. Hags sharpen their teeth on millstones and spin cloth from the intestines of their victims, reacting with glee to the horror their actions invoke."
								]
							},
							{
								"type": "entries",
								"name": "Dark Sorority",
								"entries": [
									"Hags maintain contact with each other and share knowledge. Through such contacts, it is likely that any given hag knows of every other hag in existence. Hags don't like each other, but they abide by an ageless code of conduct. Hags announce their presence before crossing into another hag's territory, bring gifts when entering another hag's dwelling, and break no oaths given to other hags-as long as the oath isn't given with the fingers crossed.",
									"Some humanoids make the mistake of thinking that the hags' rules of conduct apply to all creatures. When confronted by such an individual, a hag might find it amusing to string the fool along for a while before teaching it a permanent lesson."
								]
							},
							{
								"type": "entries",
								"name": "Dark Lairs",
								"entries": [
									"Hags dwell in dark and twisted woods, bleak moors, storm-lashed seacoasts, and gloomy swamps. In time, the landscape around a hag's lair reflects the creature's noxiousness, such that the land itself can attack and kill trespassers. Trees twisted by darkness attack passersby, while vines snake through the undergrowth to snare and drag off creatures one at a time. Foul stinking fogs turn the air to poison, and conceal pools of quicksand and sinkholes that consume unwary wanderers."
								]
							},
							{
								"type": "inset",
								"name": "Hag Covens",
								"entries": [
									"When hags must work together, they form covens, in spite of their selfish natures. A coven is made up of hags of any type, all of whom are equals within the group. However, each of the hags continues to desire more personal power.",
									"A coven consists of three hags so that any arguments between two hags can be settled by the third. If more than three hags ever come together, as might happen if two covens come into conflict, the result is usually chaos.",
									{
										"type": "entries",
										"name": "Shared Spellcasting",
										"entries": [
											"While all three members of a hag coven are within 30 feet of one another, they can each cast the following spells from the wizard's spell list but must share the spell slots among themselves:",
											{
												"type": "list",
												"style": "list-no-bullets",
												"items": [
													"1st level (4 slots): {@spell identify}, {@spell ray of sickness}",
													"2nd level (3 slots): {@spell hold person}, {@spell locate object}",
													"3rd level (3 slots): {@spell bestow curse}, {@spell counterspell}, {@spell lightning bolt}",
													"4th level (3 slots): {@spell phantasmal killer}, {@spell polymorph}",
													"5th level (2 slots): {@spell contact other plane}, {@spell scrying}",
													"6th level (1 slot): {@spell eyebite}"
												]
											},
											"For casting these spells, each hag is a 12th-level spellcaster that uses Intelligence as her spellcasting ability. The spell save DC is 12 + the hag's Intelligence modifier, and the spell attack bonus is 4 + the hag's Intelligence modifier."
										]
									},
									{
										"type": "entries",
										"name": "Hag Eye",
										"entries": [
											"A hag coven can craft a magic item called a hag eye, which is made from a real eye coated in varnish and often fitted to a pendant or other wearable item. The hag eye is usually entrusted to a minion for safekeeping and transport. A hag in the coven can take an action to see what the hag eye sees if the hag eye is on the same plane of existence. A hag eye has AC 10, 1 hit point, and {@sense darkvision} with a radius of 60 feet. If it is destroyed, each coven member takes {@damage 3d10} psychic damage and is {@condition blinded} for 24 hours.",
											"A hag coven can have only one hag eye at a time, and creating a new one requires all three members of the coven to perform a ritual. The ritual takes 1 hour, and the hags can't perform it while {@condition blinded}. During the ritual, if the hags take any action other than performing the ritual, they must start over."
										]
									}
								]
							}
						]
					},
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"name": "Lair Actions",
								"entries": [
									"The following lair actions are options for grandmothers and powerful aunties. Grandmothers usually have three to five lair actions, aunties usually only one (if they have any at all). Unless otherwise noted, any lair action that requires a creature to make a saving throw uses the save DC of the hag's most powerful ability.",
									"On initiative count 20 (losing initiative ties), the hag can take a lair action to cause one of the following effects, but can't use the same effect two rounds in a row:",
									{
										"type": "list",
										"items": [
											"Until initiative count 20 on the next round, the hag can pass through solid walls, doors, ceilings, and floors as if the surfaces weren't there.",
											"The hag targets any number of doors and windows that she can see, causing each one to either open or close as she wishes. Closed doors can be magically locked (requiring a successful {@dc 20} Strength check to force open) until she chooses to make them unlocked, or until she uses this lair action again to open them."
										]
									},
									"A powerful sea hag might have the following additional lair actions:",
									{
										"type": "list",
										"items": [
											"The hag fills up to four 10-foot cubes of water with ink. The inky areas are heavily obscured for 1 minute, although a steady, strong underwater current disperses the ink on initiative count 10. The hag ignores the obscuring effect of the ink.",
											"The hag chooses one humanoid within the lair and instantly creates a simulacrum of that creature (as if created with the {@spell simulacrum} spell). This hideous simulacrum is formed out of seaweed, slime, half-eaten fish, and other garbage, but still generally resembles the creature it is imitating. This simulacrum obeys the hag's commands and is destroyed on initiative count 20 on the next round."
										]
									}
								]
							}
						]
					},
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"name": "Regional Effects",
								"entries": [
									"Each hag's lair is the source of three to five regional effects; the home of a grandmother, an auntie, or a coven has more effects than the lair of a single hag, including some that can directly harm intruders. Any regional effect that requires a creature to make a saving throw uses the save DC of the hag's most powerful ability. These effects either end immediately if the hag dies or abandons the lair, or take up to {@dice 2d10} days to fade away.",
									"The region within 1 mile of a grandmother hag's lair is warped by the creature's fell magic, which creates one or more of the following effects:",
									{
										"type": "list",
										"items": [
											"Birds, rodents, snakes, spiders, or toads (or some other creatures appropriate to the hag) are found in great profusion.",
											"Beasts that have an Intelligence score of 2 or lower are {@condition charmed} by the hag and directed to be aggressive toward intruders in the area.",
											"Strange carved figurines, twig fetishes, or rag dolls magically appear in trees."
										]
									},
									"A powerful sea hag creates one or more of the following additional regional effects within 1 mile of her lair:",
									{
										"type": "list",
										"items": [
											"Most surfaces are covered by a thin film of slime, which is slick and sticks to anything that touches it.",
											"Currents and tides are exceptionally strong and treacherous. Any ability check made to safely navigate or control a vessel moving through these waters has disadvantage.",
											"Shores are littered with dead, rotting fish. The hag can sense when one of the fish is handled and cause it to speak with her voice."
										]
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Sea Hag.jpg"
						}
					}
				]
			},
			"tokenUrl": "https://5e.tools/img/MM/Sea Hag.png?v=1.134.0",
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/sea-hag.mp3?v=1.134.0"
			},
			"traitTags": [
				"Amphibious"
			],
			"senseTags": [
				"D"
			],
			"languageTags": [
				"AQ",
				"C",
				"GI"
			],
			"damageTags": [
				"S"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflict": [
				"frightened"
			],
			"conditionInflictSpell": [
				"frightened",
				"paralyzed",
				"poisoned",
				"unconscious"
			],
			"hasFluff": true,
			"hasFluffImages": true
		},
		{
			"name": "Follower of Yeenoghu",
			"source": "PandemoniumIvory",
			"size": "M",
			"type": {
				"type": "humanoid",
				"tags": [
					"gnoll"
				]
			},
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				11
			],
			"hp": {
				"formula": "3d8",
				"average": 13
			},
			"speed": {
				"walk": 30
			},
			"str": 14,
			"dex": 12,
			"con": 11,
			"int": 6,
			"wis": 10,
			"cha": 7,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 10,
			"languages": [
				"Gnoll"
			],
			"cr": "1/2",
			"spellcasting": [
				{
					"name": "Spellcasting",
					"headerEntries": [
						"The follower is a 1st-level spellcaster. Its spellcasting ability is Wisdom (spell save {@dc 10}, +2 to hit with spell attacks). It has the following spells prepared:"
					],
					"spells": {
						"0": {
							"spells": [
								"{@spell sacred flame}"
							]
						},
						"1": {
							"spells": [
								"{@spell chaos bolt|XGE}",
								"{@spell ray of sickness}"
							],
							"slots": 1
						}
					},
					"ability": "wis",
					"type": "spellcasting"
				}
			],
			"trait": [
				{
					"name": "Rampage",
					"entries": [
						"When the gnoll reduces a creature to 0 hit points with a melee attack on its turn, the gnoll can take a bonus action to move up to half its speed and make a bite attack."
					]
				}
			],
			"action": [
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 4} to hit, reach 5 ft., one creature. {@h}4 ({@damage 1d4 + 2}) piercing damage."
					]
				},
				{
					"name": "Spear",
					"entries": [
						"{@atk mw,rw} {@hit 4} to hit, reach 5 ft. or range 20/60 ft., one target. {@h}5 ({@damage 1d6 + 2}) piercing damage, or 6 ({@damage 1d8 + 2}) piercing damage if used with two hands to make a melee attack."
					]
				},
				{
					"name": "Longbow",
					"entries": [
						"{@atk rw} {@hit 3} to hit, range 150/600 ft., one target. {@h}5 ({@damage 1d8 + 1}) piercing damage."
					]
				}
			],
			"environment": [
				"desert",
				"forest",
				"grassland",
				"hill"
			],
			"fluff": {
				"name": "Gnoll",
				"source": "MM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"Gnolls are feral humanoids that attack settlements along the frontiers and borderlands of civilization without warning, slaughtering their victims and devouring their flesh.",
									{
										"name": "Demonic Origin",
										"type": "entries",
										"entries": [
											"The origin of the gnolls traces back to a time when the demon lord Yeenoghu found his way to the Material Plane and ran amok. Packs of ordinary hyenas followed in his wake, scavenging the demon lord's kills. Those hyenas were transformed into the first gnolls, parading after Yeenoghu until he was banished back to the Abyss. The gnolls then scattered across the face of the world, a dire reminder of demonic power."
										]
									},
									{
										"name": "Nomadic Destroyers",
										"type": "entries",
										"entries": [
											"Gnolls are dangerous because they strike at random. They emerge from the wilderness, plunder and slaughter, then move elsewhere. They attack like a plague of locusts, pillaging settlements and leaving little behind but razed buildings, gnawed corpses, and befouled land. Gnolls choose easy targets for their raids. Armored warriors holed up in a fortified castle will survive a rampaging gnoll horde unscathed, even as the towns, villages, and farms that surround the castle are ablaze, their people slaughtered and devoured.",
											"Gnolls rarely build permanent structures or craft anything of lasting value. They don't make weapons or armor, but scavenge such items from the corpses of their fallen victims, stringing ears, teeth, scalps, and other trophies from their foes onto their patchwork armor.",
											{
												"name": "Thirst for Blood",
												"entries": [
													" No goodness or compassion resides in the heart of a gnoll. Like a demon, it lacks anything resembling a conscience, and can't be taught or coerced to put aside its destructive tendencies. The gnolls' frenzied bloodlust makes them an enemy to all, and when they lack a common foe, they fight among themselves. Even the most savage orcs avoid allying with gnolls."
												],
												"type": "entries"
											}
										]
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Gnoll.jpg"
						}
					}
				]
			},
			"tokenUrl": "https://5e.tools/img/MM/Gnoll.png?v=1.134.0",
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/gnoll.mp3?v=1.134.0"
			},
			"traitTags": [
				"Rampage"
			],
			"senseTags": [
				"D"
			],
			"languageTags": [
				"OTH"
			],
			"damageTags": [
				"P"
			],
			"miscTags": [
				"MW",
				"RNG",
				"RW",
				"THW"
			],
			"hasFluff": true,
			"hasFluffImages": true
		},
		{
			"name": "Gnoll Exalted Guardian",
			"source": "PandemoniumIvory",
			"size": "L",
			"type": {
				"type": "humanoid",
				"tags": [
					"gnoll"
				]
			},
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 14,
					"from": [
						"{@item hide armor|phb}"
					]
				}
			],
			"hp": {
				"formula": "10d8 + 10",
				"average": 55
			},
			"speed": {
				"walk": 30
			},
			"str": 18,
			"dex": 16,
			"con": 13,
			"int": 14,
			"wis": 11,
			"cha": 7,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 10,
			"languages": [
				"Gnoll"
			],
			"cr": "3",
			"trait": [
				{
					"name": "Rampage",
					"entries": [
						"When the gnoll reduces a creature to 0 hit points with a melee attack on its turn, the gnoll can take a bonus action to move up to half its speed and make a bite attack."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The gnoll makes three attacks: one with its bite and two with its claws. It uses Incite Rampage if it can."
					]
				},
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 6} to hit, reach 5 ft., one target. {@h}7 ({@damage 1d6 + 4}) piercing damage, and the target must succeed on a {@dc 12} Constitution saving throw or take 7 ({@damage 2d6}) poison damage."
					]
				},
				{
					"name": "Claw",
					"entries": [
						"{@atk mw} {@hit 6} to hit, reach 5 ft., one target. {@h}8 ({@damage 1d8 + 4}) slashing damage."
					]
				}
			],
			"bonus": [
				{
					"name": "Dominate Beast (Basilisk)",
					"entries": [
						"The gnoll exalted guardian commands an instruction a basilisk that can hear and see him, this instruction is followed until the beginning of the gnoll exalted guardian's next turn. This domination works similarly to concentration, and if the concentration ends, the basilisk can disobey the instruction."
					]
				},
				{
					"name": "Incite Rampage {@recharge 5}",
					"entries": [
						"One creature the gnoll can see within 30 feet of it can use its reaction to make a melee attack if it can hear the gnoll and has the Rampage trait."
					]
				},
				{
					"name": "MOVE INTO POSITION! (Recharge short/long rest)",
					"entries": [
						"In the first round of combat, the gnoll exalted guardian commands every gnoll within a 20 ft radius sphere centered on a point he chooses. Each gnoll in the area must use their reaction to move half their movement or take a single attack."
					]
				}
			],
			"reaction": [
				{
					"name": "BREAK YOUR BONDS!",
					"entries": [
						"When a creature that the gnoll exalted guardian can see fails a saving throw, the gnoll exalted guardian can choose for them to reroll it."
					]
				},
				{
					"name": "RISE, BROTHER!",
					"entries": [
						"When a gnoll which the gnoll exalted guardian can see dies from a non-AOE attack, the gnoll can make a Charisma check of {@dc 12} to regain half of its hit points."
					]
				}
			],
			"environment": [
				"desert",
				"forest",
				"grassland",
				"hill"
			],
			"fluff": {
				"name": "Gnoll Pack Lord",
				"source": "MM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"The alpha of a gnoll pack is the pack lord, ruling by might and cunning. A pack lord earns the best of a gnoll pack's spoils, food, valuable trinkets, and magic items. It ornaments its body with brutal piercings and grotesque trophies, dyeing its fur with demonic sigils, hoping Yeenoghu will make it invulnerable.",
									{
										"type": "entries",
										"name": "Gnolls",
										"entries": [
											"Gnolls are feral humanoids that attack settlements along the frontiers and borderlands of civilization without warning, slaughtering their victims and devouring their flesh.",
											{
												"name": "Demonic Origin",
												"entries": [
													" The origin of the gnolls traces back to a time when the demon lord Yeenoghu found his way to the Material Plane and ran amok. Packs of ordinary hyenas followed in his wake, scavenging the demon lord's kills. Those hyenas were transformed into the first gnolls, parading after Yeenoghu until he was banished back to the Abyss. The gnolls then scattered across the face of the world, a dire reminder of demonic power.",
													"Gnolls rarely build permanent structures or craft anything of lasting value. They don't make weapons or armor, but scavenge such items from the corpses of their fallen victims, stringing ears, teeth, scalps, and other trophies from their foes onto their patchwork armor."
												],
												"type": "entries"
											},
											{
												"name": "Nomadic Destroyers",
												"entries": [
													" Gnolls are dangerous because they strike at random. They emerge from the wilderness, plunder and slaughter, then move elsewhere. They attack like a plague of locusts, pillaging settlements and leaving little behind but razed buildings, gnawed corpses, and befouled land. Gnolls choose easy targets for their raids. Armored warriors holed up in a fortified castle will survive a rampaging gnoll horde unscathed, even as the towns, villages, and farms that surround the castle are ablaze, their people slaughtered and devoured."
												],
												"type": "entries"
											},
											{
												"name": "Thirst for Blood",
												"entries": [
													" No goodness or compassion resides in the heart of a gnoll. Like a demon, it lacks anything resembling a conscience, and can't be taught or coerced to put aside its destructive tendencies. The gnolls' frenzied bloodlust makes them an enemy to all, and when they lack a common foe, they fight among themselves. Even the most savage orcs avoid allying with gnolls."
												],
												"type": "entries"
											}
										]
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Gnoll.jpg"
						}
					}
				]
			},
			"tokenUrl": "https://5e.tools/img/MM/Gnoll Pack Lord.png?v=1.134.0",
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/gnoll-pack-lord.mp3?v=1.134.0"
			},
			"traitTags": [
				"Rampage"
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"OTH"
			],
			"damageTags": [
				"I",
				"P",
				"S"
			],
			"miscTags": [
				"MW"
			],
			"hasFluff": true,
			"hasFluffImages": true
		},
		{
			"name": "Reduced-Threat+ Basilisk",
			"source": "PandemoniumIvory",
			"size": "M",
			"type": "monstrosity",
			"alignment": [
				"U"
			],
			"ac": [
				{
					"ac": 15,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 26,
				"formula": "4d8 + 8"
			},
			"speed": {
				"walk": 20
			},
			"str": 10,
			"dex": 8,
			"con": 15,
			"int": 2,
			"wis": 8,
			"cha": 7,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 9,
			"cr": {
				"cr": "2",
				"xp": 350
			},
			"trait": [
				{
					"name": "Petrifying Gaze",
					"entries": [
						"If a creature starts its turn within 30 feet of the basilisk and the two of them can see each other, the basilisk can force the creature to make a {@dc 10} Constitution saving throw if the basilisk isn't {@condition incapacitated}. On a failed save, the creature magically begins to turn to stone and is {@condition restrained}. It must repeat the saving throw at the end of its next turn. On a success, the effect ends. On a failure, the creature is {@condition petrified} until freed by the  {@spell greater restoration} spell or other magic.",
						"A creature that isn't surprised can avert its eyes to avoid the saving throw at the start of its turn. If it does so, it can't see the basilisk until the start of its next turn, when it can avert its eyes again. If it looks at the basilisk in the meantime, it must immediately make the save.",
						"If the basilisk sees its reflection within 30 feet of it in bright light, it mistakes itself for a rival and targets itself with its gaze."
					]
				}
			],
			"action": [
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 2} to hit, reach 5 ft., one target. {@h}10 ({@damage 1d8 + 3}) piercing damage plus 7 ({@damage 1d8}) poison damage."
					]
				}
			],
			"tokenUrl": "https://5e.tools/img/TftYP/Reduced-Threat Basilisk.png?v=1.134.0",
			"senseTags": [
				"D"
			],
			"damageTags": [
				"I",
				"P"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflict": [
				"petrified",
				"restrained"
			]
		},
		{
			"name": "Troll-Hawk Amalgamate",
			"source": "PandemoniumIvory",
			"size": "L",
			"type": "monstrosity",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 13,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 84,
				"formula": "8d10 + 40"
			},
			"speed": {
				"walk": 30,
				"fly": 20,
				"canHover": false
			},
			"str": 18,
			"dex": 13,
			"con": 20,
			"int": 7,
			"wis": 9,
			"cha": 7,
			"skill": {
				"perception": "+2"
			},
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 12,
			"languages": [
				"Giant"
			],
			"cr": "5",
			"trait": [
				{
					"name": "Regeneration",
					"entries": [
						"The troll regains 10 hit points at the start of its turn. If the troll takes acid or fire damage, this trait doesn't function at the start of the troll's next turn. The troll dies only if it starts its turn with 0 hit points and doesn't regenerate."
					]
				},
				{
					"name": "Keen Sight and Smell",
					"entries": [
						"The troll has advantage on Wisdom ({@skill Perception}) checks that rely on sight or smell."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The troll makes multiple attacks: one with its bite and five with its claws or three spike attacks."
					]
				},
				{
					"name": "Bite/Beak",
					"entries": [
						"{@atk mw} {@hit 7} to hit, reach 5 ft., one target. {@h}7 ({@damage 2d6 + 4}) piercing damage, and the target must succeed on a {@dc 10} Wisdom saving throw or be {@condition frightened} until the end of the troll's next turn."
					]
				},
				{
					"name": "Claw",
					"entries": [
						"{@atk mw} {@hit 4} to hit, reach 5 ft., one target. {@h}11 ({@damage 1d4 + 1}) slashing damage."
					]
				},
				{
					"name": "Spike",
					"entries": [
						"{@atk rw} {@hit 4} to hit, range 30/90 ft., one target. {@h}4 ({@damage 1d6 + 1}) piercing damage, and the target must succeed on a {@dc 12} Constitution saving throw or take ({@damage 1d8}) poison damage."
					]
				}
			],
			"variant": [
				{
					"type": "variant",
					"name": "Loathsome Limbs",
					"entries": [
						"Whenever the troll takes at least 15 slashing damage at one time, roll a {@dice d20} to determine what else happens to it:",
						{
							"type": "list",
							"style": "list-hang-notitle",
							"items": [
								{
									"type": "item",
									"name": "1–10:",
									"entry": "Nothing else happens."
								},
								{
									"type": "item",
									"name": "11–14:",
									"entry": "One leg is severed from the troll if it has any legs left."
								},
								{
									"type": "item",
									"name": "15–18:",
									"entry": "One arm is severed from the troll if it has any arms left."
								},
								{
									"type": "item",
									"name": "19–20:",
									"entry": "The troll is decapitated, but the troll dies only if it can't regenerate. If it dies, so does the severed head."
								}
							]
						},
						"If the troll finishes a short or long rest without reattaching a severed limb or head, the part regrows. At that point, the severed part dies. Until then, a severed part acts on the troll's initiative and has its own action and movement. A severed part has AC 13, 10 hit points, and the troll's Regeneration trait.",
						"A severed leg is unable to attack and has a speed of 5 feet.",
						"A severed arm has a speed of 5 feet and can make one claw attack on its turn, with disadvantage on the attack roll unless the troll can see the arm and its target. Each time the troll loses an arm, it loses a claw attack.",
						"If its head is severed, the troll loses its bite attack and its body is {@condition blinded} unless the head can see it. The severed head has a speed of 0 feet and the troll's Keen Smell trait. It can make a bite attack but only against a target in its space.",
						"The troll's speed is halved if it's missing a leg. If it loses both legs, it falls {@condition prone}. If it has both arms, it can crawl. With only one arm, it can still crawl, but its speed is halved. With no arms or legs, its speed is 0, and it can't benefit from bonuses to speed."
					]
				}
			],
			"environment": [
				"arctic",
				"forest",
				"hill",
				"mountain",
				"swamp",
				"underdark"
			],
			"fluff": {
				"name": "Troll",
				"source": "MM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"Born with horrific appetites, trolls eat anything they can catch and devour. They have no society to speak of, but they do serve as mercenaries to orcs, ogres, ettins, hags, and giants. As payment, trolls demand food and treasure. Trolls are difficult to control, however, doing as they please even when working with more powerful creatures.",
									{
										"name": "Regeneration",
										"type": "entries",
										"entries": [
											"Smashing a troll's bones and slashing through its rubbery hide only makes it angry. A troll's wounds close quickly. If the monster loses an arm, a leg, or even its head, those dismembered parts can sometimes act with a life of their own. A troll can even reattach severed body parts, untroubled by its momentary disability. Only acid and fire can arrest the regenerative properties of a troll's flesh. The trolls, enraged, will attack individuals making acid and fire attacks against them above all other prey."
										]
									},
									{
										"name": "Troll Freaks",
										"type": "entries",
										"entries": [
											"Their regenerative capabilities make trolls especially susceptible to mutation. Although uncommon, such transformations can result from what the troll has done or what has been done to it. A decapitated troll might grow two heads from the stump of its neck, while a troll that eats a fey creature might gain one or more of that creature's traits."
										]
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Troll.jpg"
						}
					}
				]
			},
			"tokenUrl": "https://5e.tools/img/MM/Troll.png?v=1.134.0",
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/troll.mp3?v=1.134.0"
			},
			"traitTags": [
				"Keen Senses",
				"Regeneration"
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"GI"
			],
			"damageTags": [
				"P",
				"S"
			],
			"miscTags": [
				"MW",
				"RW"
			],
			"conditionInflict": [
				"frightened"
			],
			"hasFluff": true,
			"hasFluffImages": true
		},
		{
			"name": "Xug (Kobold Scale Sorcerer)",
			"source": "PandemoniumIvory",
			"level": 4,
			"size": "S",
			"type": {
				"type": "humanoid",
				"tags": [
					"kobold"
				]
			},
			"alignment": [
				"N",
				"G"
			],
			"ac": [
				{
					"ac": 15,
					"from": [
						"draconic"
					]
				}
			],
			"hp": {
				"formula": "4d6 + 12",
				"average": 26
			},
			"speed": {
				"walk": 30
			},
			"str": 7,
			"dex": 15,
			"con": 14,
			"int": 10,
			"wis": 9,
			"cha": 18,
			"skill": {
				"arcana": "+2",
				"medicine": "+1"
			},
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 9,
			"languages": [
				"Common",
				"Draconic"
			],
			"spellcasting": [
				{
					"name": "Spellcasting",
					"headerEntries": [
						"The kobold is a 3rd-level spellcaster. Its spellcasting ability is Charisma (spell save {@dc 14}, {@hit 6} to hit with spell attacks). ",
						"It has the following sorcerer spells prepared:"
					],
					"spells": {
						"0": {
							"spells": [
								"{@spell icicle} (fire bolt)",
								"{@spell light}",
								"{@spell mage hand}",
								"{@spell prestidigitation}",
								"{@spell ray of frost}"
							]
						},
						"1": {
							"spells": [
								"{@spell charm person}",
								"{@spell magic missile}",
								"{@spell shield}"
							],
							"slots": 4
						},
						"2": {
							"spells": [
								"{@spell numbing ray} (scorching ray)",
								"{@spell spider climb}"
							],
							"slots": 3
						}
					},
					"ability": "cha",
					"type": "spellcasting"
				}
			],
			"trait": [
				{
					"name": "Sorcery Points",
					"entries": [
						"The kobold has 4 sorcery points. It regains all its spent sorcery points when it finishes a long rest. It can spend its sorcery points on the following options:",
						"Twinned Spell: When it casts a spell that targets only one creature and doesn't have a range of self, the kobold can spend a number of sorcery points equal to the spell's level to target a second creature in range with the same spell (1 sorcery point if the spell is a cantrip).",
						"Subtle Spell: When the kobold casts a spell, it can spend 1 sorcery point to cast the spell without any somatic or verbal components."
					]
				},
				{
					"name": "Dragon Ancestor",
					"entries": [
						"The kobold is a draconic bloodline sorcerer of white dragon descent."
					]
				},
				{
					"name": "Draconic Resilience",
					"entries": [
						"At 1st level, the kobold's hit point maximum increases by 1 and increases by 1 again whenever it gains a level in this class.",
						"Additionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren't wearing armor, your AC equals 13 + your Dexterity modifier."
					]
				}
			],
			"action": [
				{
					"name": "Dagger",
					"entries": [
						"{@atk mw,rw} {@hit 4} to hit, reach 5 ft. or range 20/60 ft., one target. {@h}4 ({@damage 1d4 + 2}) piercing damage."
					]
				}
			],
			"bonus": [
				{
					"name": "Quick Dice",
					"entries": [
						"Xug has a number of quick dice equal to twice his hit dice ({@dice 8d6}). He can use a number up to his level to regain hit points plus his Constitution modifier per dice."
					]
				}
			],
			"environment": [
				"forest",
				"hill",
				"mountain",
				"underdark",
				"urban"
			],
			"fluff": {
				"name": "Kobold Scale Sorcerer",
				"source": "VGM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											"A kobold scale sorcerer has an innate talent for arcane magic, making it a highly valuable member of the tribe for several reasons. Because the kobolds' deity remains imprisoned, most tribes lack individuals that can use divine magic, and so the scale sorcerers fill the roles of advisor and historian. In times of peace, they use their spells to fortify and enhance the warren and aid the rest of the tribe. When the tribe is threatened, a scale sorcerer lashes out with fire and poison against enemies, saving a bit of magic for itself in case it needs to flee or take advantage of a captor.",
											{
												"name": "Duty-Bound to a Dragon",
												"entries": [
													" In a kobold tribe associated with a dragon, typically one that resides in or near the dragon's lair, the scale sorcerer also serves as diplomat and mouthpiece-anticipating the dragon's needs, issuing commands to other kobolds on the dragon's behalf, and reporting information back to the dragon. The sorcerer is just as awed by and respectful of dragons as common kobolds are, but it knows that its duty requires it not to fawn over its master at all times. It also understands that its frequent proximity to the dragon means it would probably be the first to die if its master became angry or displeased, and so it frantically maintains a balance between adoration and terror in its behavior toward the dragon.",
													"Never make the mistake of thinking kobolds are stupid or backward just because they're small. Size has nothing to do with it.",
													"-Volo"
												],
												"type": "entries"
											}
										]
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/VGM/Kobold Scale Sorcerer.jpg"
						}
					}
				]
			},
			"tokenUrl": "https://5e.tools/img/VGM/Kobold Scale Sorcerer.png?v=1.134.0",
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/kobold-scale-sorcerer.mp3?v=1.134.0"
			},
			"senseTags": [
				"D"
			],
			"languageTags": [
				"C",
				"DR"
			],
			"damageTags": [
				"P"
			],
			"spellcastingTags": [
				"CS"
			],
			"miscTags": [
				"MW",
				"RW",
				"THW"
			],
			"conditionInflictSpell": [
				"charmed"
			],
			"hasFluff": true,
			"hasFluffImages": true
		}
	]
}
